In [1]:
import numpy
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [44]:
aer_credit = pd.read_csv('../data/AER_credit_card_data.csv')
credit_scoring = pd.read_csv('../data/CreditScoring.csv')
telco_churn = pd.read_csv('../data/WA_Fn-UseC_-Telco-Customer-Churn.csv')

In [45]:
aer_credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1319 entries, 0 to 1318
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   card         1319 non-null   object
 1   reports      1319 non-null   int64
 2   age          1319 non-null   float64
 3   income       1319 non-null   float64
 4   share        1319 non-null   float64
 5   expenditure  1319 non-null   float64
 6   owner        1319 non-null   object
 7   selfemp      1319 non-null   object
 8   dependents   1319 non-null   int64
 9   months       1319 non-null   int64
 10  majorcards   1319 non-null   int64
 11  active       1319 non-null   int64
dtypes: float64(4), int64(5), object(3)
memory usage: 123.8+ KB

In [46]:
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4455 entries, 0 to 4454
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Status     4455 non-null   int64
 1   Seniority  4455 non-null   int64
 2   Home       4455 non-null   int64
 3   Time       4455 non-null   int64
 4   Age        4455 non-null   int64
 5   Marital    4455 non-null   int64
 6   Records    4455 non-null   int64
 7   Job        4455 non-null   int64
 8   Expenses   4455 non-null   int64
 9   Income     4455 non-null   int64
 10  Assets     4455 non-null   int64
 11  Debt       4455 non-null   int64
 12  Amount     4455 non-null   int64
 13  Price      4455 non-null   int64
dtypes: int64(14)
memory usage: 487.4 KB

In [47]:
credit_scoring.columns

Index(['Status', 'Seniority', 'Home', 'Time', 'Age', 'Marital', 'Records',
       'Job', 'Expenses', 'Income', 'Assets', 'Debt', 'Amount', 'Price'],
      dtype='object')

In [48]:
credit_scoring.columns = credit_scoring.columns.str.lower().str.replace(" ",'')

In [49]:
credit_scoring.columns

Index(['status', 'seniority', 'home', 'time', 'age', 'marital', 'records',
       'job', 'expenses', 'income', 'assets', 'debt', 'amount', 'price'],
      dtype='object')

In [50]:
status_values =  {1: 'ok',2: 'default',0: 'unk'}
credit_scoring.status = credit_scoring.status.map(status_values)

In [51]:
home_values = {1: 'rent',2: 'owner',3: 'private',4: 'ignore',5: 'parents',6: 'other',0:'unk'}

credit_scoring.home = credit_scoring.home.map(home_values)

In [52]:
marital_values = {1: 'single',2: 'married',3: 'widow',4: 'separated',5: 'divorced',0: 'unk'}

credit_scoring.marital = credit_scoring.marital.map(marital_values)

In [53]:
records_values = {1: 'no',2: 'yes',0: 'unk'}

credit_scoring.records = credit_scoring.records.map(records_values)

In [54]:
job_values = {1: 'fixed',2: 'parttime',3: 'freelance',4: 'others',0: 'unk'}

credit_scoring.job = credit_scoring.job.map(job_values)

In [55]:
credit_scoring.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,ok,9,rent,60,30,married,no,freelance,73,129,0,0,800,846
1,ok,17,rent,60,58,widow,no,fixed,48,131,0,0,1000,1658
2,default,10,owner,36,46,married,yes,freelance,90,200,3000,0,2000,2985
3,ok,0,rent,60,24,single,no,fixed,63,182,2500,0,900,1325
4,ok,0,rent,36,26,single,no,fixed,46,107,0,0,310,910

In [56]:
credit_scoring.describe()

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.000000,4455.000000,4455.000000,4455.000000,4.455000e+03,4.455000e+03,4.455000e+03,4455.000000,4455.000000
mean,7.987205,46.441751,37.077666,55.568799,7.633170e+05,1.060341e+06,4.043820e+05,1039.021773,1462.875645
std,8.173444,14.655225,10.984856,19.515878,8.703625e+06,1.021757e+07,6.344253e+06,474.543007,628.089913
min,0.000000,6.000000,18.000000,35.000000,0.000000e+00,0.000000e+00,0.000000e+00,100.000000,105.000000
25%,2.000000,36.000000,28.000000,35.000000,8.000000e+01,0.000000e+00,0.000000e+00,700.000000,1117.500000
50%,5.000000,48.000000,36.000000,51.000000,1.200000e+02,3.500000e+03,0.000000e+00,1000.000000,1400.000000
75%,12.000000,60.000000,45.000000,72.000000,1.660000e+02,6.000000e+03,0.000000e+00,1300.000000,1692.000000
max,48.000000,72.000000,68.000000,180.000000,1.000000e+08,1.000000e+08,1.000000e+08,5000.000000,11140.000000

In [66]:
credit_scoring.income.max(),credit_scoring.assets.max(),credit_scoring.debt.max()

(99999999, 99999999, 99999999)

In [67]:
for col in ['income','assets','debt']:
    credit_scoring[col] = credit_scoring[col].replace(to_replace = 99999999,value=numpy.nan)

In [68]:
credit_scoring.describe()

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.000000,4455.000000,4455.000000,4455.000000,4421.000000,4408.000000,4437.000000,4455.000000,4455.000000
mean,7.987205,46.441751,37.077666,55.568799,130.568197,5403.433984,342.948614,1039.021773,1462.875645
std,8.173444,14.655225,10.984856,19.515878,86.367434,11573.161523,1245.861736,474.543007,628.089913
min,0.000000,6.000000,18.000000,35.000000,0.000000,0.000000,0.000000,100.000000,105.000000
25%,2.000000,36.000000,28.000000,35.000000,80.000000,0.000000,0.000000,700.000000,1117.500000
50%,5.000000,48.000000,36.000000,51.000000,120.000000,3000.000000,0.000000,1000.000000,1400.000000
75%,12.000000,60.000000,45.000000,72.000000,165.000000,6000.000000,0.000000,1300.000000,1692.000000
max,48.000000,72.000000,68.000000,180.000000,959.000000,300000.000000,30000.000000,5000.000000,11140.000000

In [72]:
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4455 entries, 0 to 4454
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   status     4455 non-null   object
 1   seniority  4455 non-null   int64
 2   home       4455 non-null   object
 3   time       4455 non-null   int64
 4   age        4455 non-null   int64
 5   marital    4455 non-null   object
 6   records    4455 non-null   object
 7   job        4455 non-null   object
 8   expenses   4455 non-null   int64
 9   income     4421 non-null   float64
 10  assets     4408 non-null   float64
 11  debt       4437 non-null   float64
 12  amount     4455 non-null   int64
 13  price      4455 non-null   int64
dtypes: float64(3), int64(6), object(5)
memory usage: 487.4+ KB

In [81]:
condition1 = ~credit_scoring.income.isnull()
condition2 = ~credit_scoring.assets .isnull()
condition3 = ~credit_scoring.debt.isnull()

credit_scoring = credit_scoring[(condition1) & (condition2) & (condition3)]

In [82]:
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4378 entries, 0 to 4454
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   status     4378 non-null   object
 1   seniority  4378 non-null   int64
 2   home       4378 non-null   object
 3   time       4378 non-null   int64
 4   age        4378 non-null   int64
 5   marital    4378 non-null   object
 6   records    4378 non-null   object
 7   job        4378 non-null   object
 8   expenses   4378 non-null   int64
 9   income     4378 non-null   float64
 10  assets     4378 non-null   float64
 11  debt       4378 non-null   float64
 12  amount     4378 non-null   int64
 13  price      4378 non-null   int64
dtypes: float64(3), int64(6), object(5)
memory usage: 513.0+ KB

In [71]:
credit_scoring.status.value_counts()

ok         3200
default    1254
unk           1
Name: status, dtype: int64

In [84]:
credit_scoring.home.value_counts()

owner      2065
rent        963
parents     774
other       314
private     242
ignore       20
Name: home, dtype: int64